{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "filters": 32, "trainable": true, "strides": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 200, 200, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "padding": "valid", "activation": "relu", "filters": 16, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "trainable": true, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "units": 128, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "trainable": true, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "units": 64, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "trainable": true, "name": "dense_3", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "units": 32, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "sigmoid", "trainable": true, "name": "dense_4", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 4, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.1.2"}